[
    {
        "id": 1,
        "name": "Vanco Play",
        "category": "DJ",
        "description": "Master music selector with 30+ years experience, perfect for private parties.",
        "imageUrl": "artist_image/dj/vancho.jpg",
        "profileImage": "artist_image/dj/vancho.jpg",
        "upcomingEvents": [],
        "socialMedia": {
            "instagram": "https://www.instagram.com/vanco.jovanoski/",
            "facebook": "https://www.facebook.com/vanco.jovanoski.2025"
        },
        "contact": {
            "type": "instagram",
            "value": "https://www.instagram.com/vanco.jovanoski/",
            "label": "Contact on Instagram"
        },
        "specialties": ["Disco Soul", "Jazz House", "Funk", "Jazz", "Blues", "Retro"],
        "experience": "30+ years",        
        "isActive": true,
        "bio": "🎧 Vanco Play – a true master of musical storytelling.\nWith a career that began at just 12 years old, Vanco has worked as a DJ, radio host, and moderator, but prefers to call himself a music selector. His passion lies in crafting the perfect playlist, blending genres with precision and soul. Thanks to his vast experience, he is also highly sought after for private parties, where his ability to read the crowd and create the perfect vibe truly shines.\n\nA true expert in Disco Soul, Jazz House, Funk, Jazz, Blues, and Retro, Vanco Play transforms every set into a unique musical journey that connects deeply with his audience."
    },
    {
        "id": 2,
        "name": "Mario",
        "category": "DJ",
        "description": "Ohrid DJ since 2006, mixing Disco, Funky, Afro House, and nostalgic retro hits.",
        "imageUrl": "artist_image/dj/mario.jpg",
        "profileImage": "artist_image/dj/mario.jpg",
        "upcomingEvents": [         
        ],
        "socialMedia": {
            "instagram": "https://www.instagram.com/deejay.mario",
            "facebook": "https://www.facebook.com/deejay.mariooo?mibextid=wwXIfr&rdid=ustNpp9th8IGwwHN&share_url=https%3A%2F%2Fwww.facebook.com%2Fshare%2F171EUbGZVf%2F%3Fmibextid%3DwwXIfr#"
        },
        "contact": {
            "type": "instagram",
            "value": "https://www.instagram.com/deejay.mario",
            "label": "Message on Instagram"
        },
        "specialties": ["Disco", "Funky", "Club", "Afro House", "Retro"],
        "experience": "18+ years",        
        "isActive": true,
        "bio": "🎧 DJ Mario, an Ohrid-based DJ active since 2006, is a passionate vinyl collector and music lover, blending sounds from retro to modern eras. His sets unite Disco, Funky, Club, and Afro House, along with nostalgic retro hits that ignite unforgettable energy on the dance floor.\n\nWith a commitment to strictly high-quality, timeless tracks, DJ Mario creates a unique atmosphere that keeps the crowd moving all night."
    },   
     {
         "id": 3,
         "name": "Urban Planet",
         "category": "Band",
         
         "description": "Urban Planet is a Disco-Funky band from Ohrid, bringing vibrant energy and groove.",
        "imageUrl": "artist_image/band/urban.jpg",
        "profileImage": "artist_image/band/urban.jpg",
        "upcomingEvents": [         
        ],
        "socialMedia": {
            "instagram": "https://www.instagram.com/urbanplanettheband/",
            "facebook": "https://www.facebook.com/urbanplanettheband"
        },
        "contact": {
            "type": "phone",
            "value": "077 664 786",
            "label": "Call Us"
        },
        "specialties": ["Disco", "Funk", "Live Performance", "Weddings", "Private Events", "Dance Music"],
        "experience": "5+ years",        
        "isActive": true,
        "bio": "🎵 Urban Planet is a Disco-Funky band from Ohrid, bringing vibrant energy and groove to every stage. The five-member lineup features Dimitar Alchev on vocals, Filip Nikolovski on guitar, Nikola Josifoski on keyboards and backing vocals, Hendrik Zinger on bass guitar, and Bobi Damchevski on drums and backing vocals.\n\nPerforming together for over five years, the band has become a familiar presence in Ohrid's music scene, as well as in Bitola, Struga, and Skopje. From lively local gigs to private events such as weddings, seminars, and celebrations of all kinds, Urban Planet delivers a dynamic blend of rhythm and soul that gets everyone dancing."
    },
    {
        "id": 4,
        "name": "Bad Contract",
        "category": "Rap",
        "description": "Bad Contract is a legendary rap group from Ohrid, formed in 2001.",
        "imageUrl": "artist_image/rap/bc.jpg",
        "profileImage": "artist_image/rap/bc.jpg",
        "upcomingEvents": [],
        "socialMedia": {
            "instagram": "https://www.instagram.com/maca_trpeski/",
            "facebook": "https://www.facebook.com/maca.trpeski",
            "instagram2": "https://www.instagram.com/meckarov_official/",
            "facebook2": "https://www.facebook.com/Meckarow"
        },
        "specialties": ["Rap", "Hip Hop", "Live Performance"],
        "isActive": true,
        "experience": "20+ years",
        "hideBooking": true,
        "bio": "Bad Contract is a legendary rap group from Ohrid, formed in 2001. Their name, Bad Contract, was inspired by the significant events surrounding the signing of the Ohrid Agreement. The group consists of two members: Maca MF (Marjan Trpeski) and Meckarov (Naum Doloski).\n\nTheir songs and themes are deeply rooted in real-life experiences and events they lived through at the time of recording. Still active today, they continue to record and perform, while also working on their solo projects and new material as Bad Contract.\n\nSome of their most popular tracks include:\n\n• Alkoholika\n• Srceto na Lavot\n• Dupnime Jako\n • Alo (featuring Gazda Paja & Young Palk)"
    },
    {
        "id": 5,
        "name": "Backdoor Band",
        "category": "Band",
        "description": "High-energy rock band from Ohrid delivering authentic performances.",
        "imageUrl": "artist_image/band/backdor.jpg",
        "profileImage": "artist_image/band/backdor.jpg",
        "upcomingEvents": [],
        "socialMedia": {
            "instagram": "https://www.instagram.com/thebackdoorband/",
            "facebook": "https://www.facebook.com/BackdoorBandOhrid"          
        },
        "contact": {
            "type": "phone",
            "value": "+38977922921",
            "label": "Call Us"
        },
        "specialties": ["Rock", "Live Performance"],
        "isActive": true,
        "experience": "20+ years",
        "hideBooking": false,
        "bio": "The Backdoor Band – Straight out of Ohrid, Macedonia, we've been rocking stages across the country and beyond, winning over crowds with our high-energy performances. For years, we were known as a powerhouse cover band, bringing classic rock and timeless hits to life. But in early 2013, we took things to the next level and began crafting our own original music — a raw, authentic sound straight from the heart.\n\nWith Žarko Jakimoski on lead vocals & bass, Laze Farmakoski shredding on lead guitar, and Nikola Koljuševski-Ozzy driving the beat on drums & backing vocals, we deliver pure rock 'n' roll spirit with every show.\n\nSo grab a drink, turn it up, and join us on this ride. Keep on rockin' and follow us! 🤘🍻🤘"
    },
    {
        "id": 6,
        "name": "VIS Biljana",
        "category": "Band",
        "description": "Ohrid's troubadour ensemble preserving traditional melodies since 2009.",
        "imageUrl": "artist_image/chalgija/visbiljana.jpg",
        "profileImage": "artist_image/chalgija/visbiljana.jpg",
        "upcomingEvents": [],
        "socialMedia": {
            "instagram": "https://www.instagram.com/vis_biljana/",
            "facebook": "https://www.facebook.com/ansamblbiljanaohrid"          
        },
        "contact": {
            "type": "phone",
            "value": "+38978804078",
            "label": "Call Us"
        },
        "specialties": ["Traditional", "Folk", "Live Performance"],
        "isActive": true,
        "experience": "14+ years",
        "hideBooking": false,
        "bio": "VIS Biljana was founded in 2009, carrying on the legacy as the fourth troubadour generation of the city of Ohrid. From the very beginning, the ensemble has been dedicated to nurturing the authentic musical spirit of our region, creating a bridge between tradition and the present. Over the years, we have released two music albums and built a tradition of three annual concerts that hold a special place in the cultural life of Ohrid.\n\nThe first is held on Petrovden, a unique celebration performed on the waters of Lake Ohrid, symbolizing the harmony between music and nature. The second concert is a humanitarian event, dedicated to our late colleague and dear friend Andrej Labroski, with all proceeds supporting associations and individuals from vulnerable groups across the country. The third is our signature annual concert, \"Охридска визита\", through which we strive to honor and preserve the spiritual and musical heritage of our beloved city.\n\nWith every performance, VIS Biljana remains devoted to keeping Ohrid's tradition alive, while sharing its timeless melodies with future generations."
    },
    {
        "id": 7,
        "name": "DJ Bagzi",
        "category": "DJ",
        "description": "DJ Bagzi is a breath of fresh air on the Macedonian music scene, establishing himself as a truly original hip-hop artist and a visionary producer.",
        "imageUrl": "artist_image/dj/bagzi.jpg",
        "profileImage": "artist_image/dj/bagzi.jpg",
        "upcomingEvents": [],
        "socialMedia": {
            "instagram": "https://www.instagram.com/blagojmathers/"
        },
        "contact": {
            "type": "instagram",
            "value": "https://www.instagram.com/blagojmathers/",
            "label": "Contact on Instagram"
        },
        "specialties": ["Hip Hop", "Rap", "Old School", "Modern Trends", "Live Performance"],
        "isActive": true,
        "experience": "5+ years",
        "hideBooking": false,
        "bio": "🎧 DJ Bagzi – a breath of fresh air on the Macedonian music scene, establishing himself as a truly original hip-hop artist and a visionary producer. With a focus on authentic songwriting and creative autonomy, he is currently finalizing the production of his highly anticipated debut album, marking a significant milestone in his rising career.\n\n🎵 A Fusion of Eras: Old-School Soul Meets Modern Trends\nWhat sets DJ Bagzi apart is his unique dual identity as both a powerful hip-hop lyricist and a versatile DJ. His performances are a masterclass in musical storytelling, where he meticulously nurtures the \"old-school\" rap aesthetic of the 80s, 90s, and 2000s. However, he is far from a nostalgia act; Bagzi skillfully weaves the latest modern music trends into his sessions, creating a seamless bridge between the roots of hip-hop and the sounds of tomorrow.\n\n🌍 From Cult Macedonian Venues to the Miami Club Scene\nHis journey has seen him grace the stages of the most iconic cult venues across Macedonia, performing at the country's most significant cultural and musical events. The crowning achievement of his career thus far is his successful expansion into the international arena, with a series of notable performances in Miami, USA. This international experience has refined his craft, allowing him to bring a world-class energy back to his local roots.\n\n🎤 The Complete Audiovisual Experience\nDJ Bagzi is more than just a musician; he is a \"complete product.\" To witness him live is to experience a perfect synergy of sound, style, and stage presence. Whether through his original tracks or his expertly curated DJ sets, he offers a professional and high-energy experience that is a pure pleasure to listen to, watch, and enjoy."
    }
]
