{
    "mk": {
        "title": "Откријте го Охрид",
        "fullContent": "\n                    <div class=\"ohrid-content-wrapper\">\n                        <h1>Откријте го Охрид</h1>\n                        <p>Охрид е град кој се наоѓа во Северна Македонија и има извонредно богата и долга историја. Сместен на брегот на прекрасното Охридско Езеро, овој град е многу повеќе од убава туристичка дестинација – тој е живо сведоштво за минатото, со слоеви цивилизации и култури кои се вгнездени една врз друга. Кога ќе го посетите Охрид, ќе видите град кој дише историја: од античките руини до средновековните цркви (за кои се вели дека некогаш имало 365, по една за секој ден во годината!), од традиционалната охридска архитектура до прекрасните плажи на езерото. Секој камен, секоја улица раскажува приказна за минатото, правејќи го Охрид место каде што историјата и убавината се испреплетуваат на уникатен начин.</p>\n                        <h2>Антички корени и Лихнидос – Влезот во историјата на Охрид</h2>\n                        <p>Историјата на Охрид започнува многу одамна, уште во антички времиња. Најпрво, градот бил познат како Лихнидос, што на старогрчки најверојатно значи \"град на светлината\" или \"бел град\\\". Ова име му било дадено веројатно поради прекрасната бела карпа на која бил изграден стариот дел на градот. Лихнидос бил важна станица на античкиот пат Виа Игнација, кој го поврзувал Рим со Византија (денешен Истанбул). Тоа значи дека низ Охрид поминувале трговци, војници и патници од целиот антички свет, што придонесе за неговиот развој и значење. Денес, еден од највпечатливите остатоци од овој период е Античкиот театар. Овој добро сочуван театар, сместен во стариот дел на градот, бил изграден околу 200 година п.н.е. и некогаш собирал илјадници гледачи. Денес, тој сè уште е домаќин на концерти, фестивали и претстави, оживувајќи ја античката историја на Охрид.</p>\n                        <h2>Подемот на словенската култура – Лулката на писменоста</h2>\n                        <p>Со доаѓањето на Словените на Балканот, Лихнидос почнува да се преобразува и го добива своето денешно име – Охрид. Еден од најзначајните периоди во историјата на градот е поврзан со светите браќа Кирил и Методиј и нивните ученици. Во 9 век, нивниот ученик Свети Климент Охридски доаѓа во Охрид и тука ја основа Охридската книжевна школа. Оваа школа била еден од најважните центри за ширење на словенската писменост и култура. Токму во Охрид се создале првите словенски книги, а Свети Климент вовел и нов систем на писмо – кирилицата, која и денес ја користат многу словенски народи. Затоа, Охрид често се нарекува и \"словенски Ерусалим\" или \"лулка на словенската писменост и култура\\\". Еден од најзначајните објекти кои ја раскажуваат оваа приказна е Црквата \"Свети Климент и Пантелејмон\" на Плаошник. Изградена на местото на древна базилика, оваа црква е реконструирана врз темелите на првобитната црква на Свети Климент. Таа претставува духовно и културно средиште, а во нејзина близина се пронајдени и остатоци од првиот словенски универзитет, што го прави местото особено значајно за словенската историја.</p>\n                        <h2>Цар Самуил и средновековна престолнина – Моќта на царството</h2>\n                        <p>Во доцниот 10 и раниот 11 век, Охрид доживува уште еден златен период. Во тоа време, градот станува престолнина на големото царство на Цар Самуил. Од Охрид, Самуил владеел со широка територија, а градот бил утврден со моќни ѕидини и тврдини. Денес, Самуиловата тврдина се издига над градот и е една од најубавите глетки, од каде што се пружа панорамски поглед на Охридското Езеро и околината. Оваа тврдина, со своите масивни ѕидови и кули, сведочи за воената моќ и стратешкото значење на Охрид во средниот век. Внатре во тврдината се наоѓа и местото каде што некогаш се наоѓала палатата на царот. Друга импозантна градба од средниот век е Црквата Света Софија. Првично изградена како катедрална црква на Охридската архиепископија, таа е еден од најважните споменици на средновековната архитектура во Северна Македонија. Нејзините фрески се пример за византиската уметност, а архитектурата покажува различни фази на градба низ вековите.</p>\n                        <h2>Отоманско владеење и ренесанса – Архитектурата на минатото</h2>\n                        <p>По падот на Самуиловото царство, Охрид потпаѓа под византиска, а подоцна и под отоманска власт, која траела речиси пет века. Иако градот го изгубил својот статус на престолнина, тој останал важен верски и трговски центар. За време на отоманското владеење, во Охрид се граделе џамии и амами (турски бањи), но и многу цркви продолжиле да функционираат. Еден од симболите на охридската архитектура од овој период се старите охридски куќи. Со нивните карактеристични балкони, чардаци и дрвени фасади, овие куќи, како на пример куќата на семејството Робевци (која денес е музеј), даваат увид во животот и начинот на градба од тоа време. Посетата на оваа куќа ќе ви овозможи да погледнете како се живеело во Охрид во 19 век, со богата етнографска збирка и археолошки артефакти. Прошетајте по калдрмисаните улици на стариот град за да ја почувствувате автентичната атмосфера.</p>\n                        <h2>Модерното доба и светско наследство – Охрид денес</h2>\n                        <p>По Балканските војни и Првата светска војна, Охрид станува дел од Кралството Југославија, а по Втората светска војна, дел од Социјалистичка Република Македонија во рамките на Југославија. Од 1991 година, Охрид е дел од независна Република Северна Македонија.</p>\n                        <p>Денес, Охрид е препознаен од целиот свет како место со извонредна вредност. Во 1979 година, Охридското Езеро е прогласено за Светско природно наследство на УНЕСКО, а во 1980 година, и самиот град Охрид е прогласен за Светско културно наследство на УНЕСКО. Ова значи дека и градот и езерот се под посебна заштита поради нивната универзална важност.</p>\n                        <p>Не заборавајте да ја посетите и Црквата \"Свети Јован Канео\\\", сместена на карпа над езерото. Оваа црква, со нејзината живописна локација и прекрасниот поглед, е една од најфотографираните знаменитости во Охрид и ја симболизира хармонијата меѓу природната убавина и богатото културно наследство на градот. Покрај овие историски и културни локалитети, Охрид нуди и многу повеќе за еден турист. Уживајте во прошетка покрај кејот на Охридското Езеро, пробајте ги локалните специјалитети како охридската пастрмка и искористете ја можноста за возење со брод по езерото за да ја доживеете целата негова убавина и да ги посетите околните манастири како Свети Наум. Охрид е град кој ве повикува да го истражите неговото минато, да уживате во неговата сегашност и да се инспирирате од неговата бесценета убавина.</p>\n                    </div>",
        "images": [
            "images_ohrid/photo1.jpg",
            "images_ohrid/photo2.jpg",
            "images_ohrid/photo3.jpg",
            "images_ohrid/photo4.jpg",
            "images_ohrid/photo5.jpg"
        ]
    },
    "en": {
        "title": "Discover Ohrid",
        "fullContent": "\n                    <div class=\"ohrid-content-wrapper\">\n                        <h1>Discover Ohrid</h1>\n                        <p>Ohrid is a city located in North Macedonia with an exceptionally rich and long history. Situated on the shores of the beautiful Lake Ohrid, this city is much more than just a lovely tourist destination – it's a living testament to the past, with layers of civilizations and cultures nestled one upon another. When you visit Ohrid, you'll see a city that breathes history: from ancient ruins to medieval churches (of which it's said there were once 365, one for every day of the year!), from traditional Ohrid architecture to the stunning beaches of the lake. Every stone, every street tells a story of the past, making Ohrid a place where history and beauty intertwine in a unique way.</p>\n                        <h2>Ancient Roots and Lychnidos – The Entry into Ohrid's History</h2>\n                        <p>Ohrid's history began long ago, in ancient times. Initially, the city was known as Lychnidos, which in ancient Greek likely means \"city of light\" or \"white city.\\\" This name was probably given due to the beautiful white rock on which the old part of the city was built. Lychnidos was an important stop on the ancient road Via Egnatia, which connected Rome with Byzantium (modern-day Istanbul). This meant that merchants, soldiers, and travelers from across the ancient world passed through Ohrid, contributing to its development and significance. Today, one of the most striking remains from this period is the Ancient Theatre. This well-preserved theatre, located in the old part of the city, was built around 200 BC and once seated thousands of spectators. Today, it still hosts concerts, festivals, and performances, bringing Ohrid's ancient history to life.</p>\n                        <h2>The Rise of Slavic Culture – The Cradle of Literacy</h2>\n                        <p>With the arrival of the Slavs in the Balkans, Lychnidos began to transform and received its current name – Ohrid. One of the most significant periods in the city's history is linked to the holy brothers Cyril and Methodius and their disciples. In the 9th century, their disciple Saint Clement of Ohrid came to Ohrid and established the Ohrid Literary School here. This school was one of the most important centers for the spread of Slavic literacy and culture. It was in Ohrid that the first Slavic books were created, and Saint Clement also introduced a new writing system – the Cyrillic alphabet, which is still used by many Slavic nations today. For this reason, Ohrid is often called the \"Slavic Jerusalem\" or the \"cradle of Slavic literacy and culture.\\\" One of the most important sites that tells this story is the Church of Saints Clement and Panteleimon at Plaošnik. Built on the site of an ancient basilica, this church was reconstructed on the foundations of Saint Clement's original church. It represents a spiritual and cultural center, and remains of the first Slavic university have also been found nearby, making the place particularly significant for Slavic history.</p>\n                        <h2>Tsar Samuel and the Medieval Capital – The Power of the Empire</h2>\n                        <p>In the late 10th and early 11th centuries, Ohrid experienced another golden age. At that time, the city became the capital of Tsar Samuel's great empire. From Ohrid, Samuel ruled a vast territory, and the city was fortified with mighty walls and strongholds. Today, Samuel's Fortress stands majestically above the city and offers one of the most beautiful panoramic views of Lake Ohrid and its surroundings. This fortress, with its massive walls and towers, bears witness to Ohrid's military might and strategic importance in the Middle Ages. Inside the fortress, you can also find the site where the Tsar's palace once stood. Another imposing medieval building is the Church of Saint Sophia. Originally built as the cathedral church of the Ohrid Archbishopric, it is one of the most important monuments of medieval architecture in North Macedonia. Its frescoes are an example of Byzantine art, and its architecture shows various phases of construction throughout the centuries.</p>\n                        <h2>Ottoman Rule and Renaissance – The Architecture of the Past</h2>\n                        <p>After the fall of Samuel's empire, Ohrid came under Byzantine, and later Ottoman rule, which lasted for almost five centuries. Although the city lost its status as a capital, it remained an important religious and commercial center. During Ottoman rule, mosques and hammams (Turkish baths) were built in Ohrid, but many churches also continued to function. One of the symbols of Ohrid's architecture from this period are the old Ohrid houses. With their characteristic balconies, verandas, and wooden facades, these houses, such as the Robevci House (which is now a museum), offer insight into the life and construction methods of that time. Visiting this house will allow you to see how people lived in Ohrid in the 19th century, with a rich ethnographic collection and archaeological artifacts. Stroll along the cobblestone streets of the old town to feel its authentic atmosphere.</p>\n                        <h2>Modern Era and World Heritage – Ohrid Today</h2>\n                        <p>After the Balkan Wars and World War I, Ohrid became part of the Kingdom of Yugoslavia, and after World War II, part of the Socialist Republic of Macedonia within Yugoslavia. Since 1991, Ohrid has been part of independent North Macedonia.</p>\n                        <p>Today, Ohrid is recognized worldwide as a place of extraordinary value. In 1979, Lake Ohrid was declared a UNESCO World Natural Heritage Site, and in 1980, the city of Ohrid itself was declared a UNESCO World Cultural Heritage Site. This means that both the city and the lake are under special protection due to their universal importance.</p>\n                        <p>Don't forget to visit the Church of Saint John at Kaneo, situated on a cliff above the lake. This church, with its picturesque location and stunning views, is one of the most photographed landmarks in Ohrid and symbolizes the harmony between the natural beauty and rich cultural heritage of the city. Beyond these historical and cultural sites, Ohrid offers much more for a tourist. Enjoy a stroll along the promenade of Lake Ohrid, try local specialties like the Ohrid trout, and take the opportunity for a boat ride on the lake to experience its full beauty and visit nearby monasteries like Saint Naum. Ohrid is a city that invites you to explore its past, enjoy its present, and be inspired by its priceless beauty.</p>\n                    </div>",
        "images": [
            "images_ohrid/photo1.jpg",
            "images_ohrid/photo2.jpg",
            "images_ohrid/photo3.jpg",
            "images_ohrid/photo4.jpg",
            "images_ohrid/photo5.jpg"
        ]
    }
} 