{
    "mk": "<h1>Откријте го Охрид: Патување низ времето и убавината</h1><p>Сместен на брегот на волшебното Охридско Езеро во Северна Македонија, Охрид е град каде историјата шепоти низ секоја калдрмисана улица и древен камен. Повеќе од само туристичка дестинација, тој е жива приказна за цивилизации и култури што се преплетуваат низ вековите. Од античките корени до средновековниот сјај, Охрид ве кани да прошетате низ времето, да се восхитите на неговите пејзажи и да се препуштите на неговиот вечен шарм.</p><h2>Антички почетоци: Градот на светлината</h2><p>Приказната за Охрид започнува во античко време, кога бил познат како Лихнидос, име што на старогрчки значи „град на светлината“ или „бел град“, инспирирано од белите карпи врз кои е изграден стариот дел од градот. Како важна станица на патот Виа Игнација, што ги поврзувал Рим и Византија, Лихнидос бил раскрсница на трговци, патници и војници. Еден од неговите највпечатливи споменици е Античкиот театар, изграден околу 200 година п.н.е. Овој добро сочуван амфитеатар некогаш одекнувал од аплаузи на илјадници гледачи, а денес оживува со концерти и фестивали под ѕвездите.</p><h2>Лулка на словенската култура</h2><p>Со доаѓањето на Словените, Лихнидос станува Охрид, име што ќе одекне низ историјата. Во 9 век, Свети Климент Охридски, ученик на светите браќа Кирил и Методиј, ја основал Охридската книжевна школа, светилник на словенската писменост. Тука се создадени првите словенски книги и е родена кирилицата, што ја прави Охрид „словенски Ерусалим“. Црквата „Свети Климент и Пантелејмон“ на Плаошник, обновена врз темелите на првобитната црква на Свети Климент, е духовно срце на градот. Во близина се пронајдени остатоци од првиот словенски универзитет, што го прави ова место незаменливо за словенската историја.</p><h2>Средновековен сјај: Царството на Самуил</h2><p>Кон крајот на 10 век, Охрид станува престолнина на царството на Цар Самуил. Од тука, тој владеел со огромна територија, а градот бил заштитен со моќни тврдини. Самуиловата тврдина, гордо издигната над езерото, нуди неверојатен поглед и сведочи за средновековната сила на Охрид. Прошетајте по нејзините ѕидини и замислете ја некогашната царска палата. Во близина, Црквата „Света Софија“, со своите византиски фрески и слоевита архитектура, е бисер на средновековната уметност.</p><h2>Отомански шарм: Куќите на минатото</h2><p>Под отоманска власт, Охрид останал верски и трговски центар. Џамии и амами се издигале, но црквите продолжиле да живеат. Старите охридски куќи, со дрвени чардаци и балкони, го отсликуваат духот на тоа време. Посетете ја куќата на Робевци, денес музеј, за да ѕирнете во животот од 19 век преку нејзините етнографски и археолошки збирки. Шетајќи по калдрмисаните улички на стариот град, ќе ја почувствувате автентичната душа на Охрид.</p><h2>Охрид денес: Бисер на УНЕСКО</h2><p>Охрид е светски признат за својата уникатна вредност. Во 1979 година, Охридското Езеро станува Светско природно наследство на УНЕСКО, а во 1980 година, градот е прогласен за Светско културно наследство. Црквата „Свети Јован Канео“, сместена на карпа над езерото, е симбол на хармонијата меѓу природата и културата, со поглед што го одзема здивот.</p><h2>Уживајте во Охрид: Од историја до денес</h2><p>Охрид не е само историја – тој е место за уживање. Прошетајте по кејот покрај езерото, каде водата блеска под сонцето. Пробајте ја вкусната охридска пастрмка или уживајте во возење со брод до манастирот Свети Наум. Без разлика дали истражувате антички руини, се восхитувате на средновековни цркви или се релаксирате на плажа, Охрид ве освојува со својата магија.</p><p>Дојдете во Охрид. Пуштете ги неговите приказни да ве водат, неговата убавина да ве инспирира и неговата топлина да ве прегрне во свет каде времето е вечно.</p>",
    "en": "<h1>Discover Ohrid: A Journey Through Time and Beauty</h1><p>Nestled on the shimmering shores of Lake Ohrid in North Macedonia, Ohrid is a city where history whispers through every cobblestone street and ancient stone. More than just a picturesque destination, it's a vibrant tapestry of civilizations, cultures, and stories woven together over centuries. From its ancient roots to its medieval grandeur, Ohrid invites you to stroll through time, marvel at its stunning landscapes, and soak in its timeless charm.</p><h2>Ancient Beginnings: The City of Light</h2><p>Ohrid's story begins in antiquity, when it was known as Lychnidos, meaning \"city of light\" or \"white city\" in ancient Greek—a name inspired by the gleaming white rocks that form the foundation of its old town. As a key stop along the Via Egnatia, the ancient road linking Rome to Byzantium, Lychnidos buzzed with merchants, travelers, and soldiers, shaping it into a thriving hub. One of its most captivating relics is the Ancient Theatre, built around 200 BC. This remarkably preserved amphitheater once echoed with the cheers of thousands and still comes alive today with concerts and festivals, connecting past and present under the stars.</p><h2>The Cradle of Slavic Culture</h2><p>As the Slavs arrived in the Balkans, Lychnidos transformed into Ohrid, a name that would soon resonate through history. In the 9th century, Saint Clement, a disciple of the holy brothers Cyril and Methodius, founded the Ohrid Literary School, a beacon of Slavic literacy and culture. Here, the Cyrillic alphabet was born, and the first Slavic books were crafted, earning Ohrid the title of \"Slavic Jerusalem.\" Visit the Church of Saints Clement and Panteleimon at Plaošnik, lovingly rebuilt on the foundations of Saint Clement's original church. Nearby, traces of the first Slavic university remind us of Ohrid's profound role in shaping Slavic heritage.</p><h2>A Medieval Golden Age</h2><p>In the late 10th century, Ohrid rose to prominence as the capital of Tsar Samuel's empire. From here, he governed a vast realm, fortifying the city with robust walls and towers. Perched above the lake, Samuel's Fortress offers breathtaking views and a glimpse into Ohrid's medieval might. Wander its ancient ramparts and imagine the grandeur of the Tsar's palace that once stood within. Nearby, the Church of Saint Sophia, a masterpiece of Byzantine art, dazzles with its intricate frescoes and layered architecture, reflecting centuries of devotion and craftsmanship.</p><h2>Ottoman Charm and Timeless Architecture</h2><p>Under Ottoman rule, Ohrid retained its vibrancy as a religious and commercial center. Mosques and hammams dotted the city, yet its Christian heritage endured. The old Ohrid houses, with their wooden balconies and verandas, capture the essence of this era. Step inside the Robevci House, now a museum, to explore 19th-century life through its ethnographic treasures and archaeological displays. As you wander the narrow, cobblestone streets of the old town, milking the scent of history and the warmth of Ohrid's spirit envelop you.</p><h2>Ohrid Today: A UNESCO Gem</h2><p>Ohrid's universal value shines bright in the modern era. In 1979, Lake Ohrid was named a UNESCO World Natural Heritage Site, followed by the city itself in 1980 as a UNESCO World Cultural Heritage Site. This dual recognition celebrates the harmony of Ohrid's natural beauty and cultural riches. No visit is complete without seeing the Church of Saint John at Kaneo, perched dramatically on a cliff overlooking the lake. Its serene beauty and iconic views make it a symbol of Ohrid's soul.</p><h2>Beyond History: Embracing Ohrid's Charms</h2><p>Ohrid is more than its past—it's a place to savor the moment. Stroll along the lake's promenade, where the water sparkles under the sun. Indulge in local delicacies like the famed Ohrid trout, fresh from the lake. Take a boat ride to the tranquil Saint Naum Monastery or simply relax on the sandy beaches. Whether you're exploring ancient ruins, admiring medieval churches, or soaking in the lake's serenity, Ohrid captivates with its blend of history, culture, and natural splendor.</p><p>Come to Ohrid. Let its stories unfold, its beauty inspire, and its warmth welcome you into a world where time feels eternal.</p>"
}